Duet3D/Duet3Expansion/src/atmel/SAME53_DFP/1.0.57/atdf/ATSAME53N20A.atdf
        <module name="QSPI" id="U2008" version="1.6.3">
          <instance name="QSPI">
            <register-group name="QSPI" name-in-module="QSPI" address-space="base" offset="0x42003400"/>
            <signals>
              <signal group="CS" function="H" pad="PB11"/>
              <signal group="DATA" index="0" function="H" pad="PA08"/>
              <signal group="DATA" index="1" function="H" pad="PA09"/>
              <signal group="DATA" index="2" function="H" pad="PA10"/>
              <signal group="DATA" index="3" function="H" pad="PA11"/>
              <signal group="SCK" function="H" pad="PB10"/>
            </signals>
            <parameters>
              <param name="DMAC_ID_RX" value="83"/>
              <param name="DMAC_ID_TX" value="84"/>
              <param name="HADDR_MSB" value="23"/>
              <param name="OCMS" value="1"/>
              <param name="INSTANCE_ID" value="77"/>
            </parameters>
          </instance>
        </module>
        <module name="RAMECC" id="U2268" version="1.0.0">
          <instance name="RAMECC">
            <register-group name="RAMECC" name-in-module="RAMECC" address-space="base" offset="0x41020000"/>
            <parameters>
              <param name="RAMADDR_BITS" value="13"/>
              <param name="RAMBANK_NUM" value="4"/>
              <param name="INSTANCE_ID" value="48"/>
            </parameters>
          </instance>
        </module>
        <module name="RSTC" id="U2239" version="4.0.0">
          <instance name="RSTC">
            <register-group name="RSTC" name-in-module="RSTC" address-space="base" offset="0x40000C00"/>
            <parameters>
              <param name="BACKUP_IMPLEMENTED" value="1"/>
              <param name="HIB_IMPLEMENTED" value="1"/>
              <param name="NUMBER_OF_EXTWAKE" value="0"/>
              <param name="NVMRST_IMPLEMENTED" value="1"/>
              <param name="INSTANCE_ID" value="3"/>
            </parameters>
          </instance>
        </module>
        <module name="RTC" id="U2250" version="2.1.0">
          <instance name="RTC">
            <register-group name="RTC" name-in-module="RTC" address-space="base" offset="0x40002400"/>
            <signals>
              <signal group="IN" index="0" function="RTC" pad="PB00"/>
              <signal group="IN" index="1" function="RTC" pad="PB02"/>
              <signal group="IN" index="2" function="RTC_IN_2" pad="PA02"/>
              <signal group="IN" index="3" function="RTC" pad="PC00"/>
              <signal group="IN" index="4" function="RTC" pad="PC01"/>
              <signal group="OUT" function="RTC" pad="PB01"/>
            </signals>
            <parameters>
              <param name="DMAC_ID_TIMESTAMP" value="1"/>
              <param name="GPR_NUM" value="4"/>
              <param name="NUM_OF_ALARMS" value="2"/>
              <param name="NUM_OF_BKREGS" value="8"/>
              <param name="NUM_OF_COMP16" value="4"/>
              <param name="NUM_OF_COMP32" value="2"/>
              <param name="NUM_OF_TAMPERS" value="5"/>
              <param name="PER_NUM" value="8"/>
              <param name="INSTANCE_ID" value="9"/>
            </parameters>
          </instance>
        </module>
        <module name="SDHC" id="U2011" version="1.8.3">
          <instance name="SDHC0">
            <register-group name="SDHC0" name-in-module="SDHC" address-space="base" offset="0x45000000"/>
            <signals>
              <signal group="SDCD" function="I" pad="PA06"/>
              <signal group="SDCD" function="I" pad="PA12"/>
              <signal group="SDCD" function="I" pad="PB12"/>
              <signal group="SDCD" function="I" pad="PC06"/>
              <signal group="SDCK" function="I" pad="PB11"/>
              <signal group="SDCMD" function="I" pad="PA08"/>
              <signal group="SDDAT" index="0" function="I" pad="PA09"/>
              <signal group="SDDAT" index="1" function="I" pad="PA10"/>
              <signal group="SDDAT" index="2" function="I" pad="PA11"/>
              <signal group="SDDAT" index="3" function="I" pad="PB10"/>
              <signal group="SDWP" function="I" pad="PA07"/>
              <signal group="SDWP" function="I" pad="PA13"/>
              <signal group="SDWP" function="I" pad="PB13"/>
              <signal group="SDWP" function="I" pad="PC07"/>
            </signals>
            <parameters>
              <param name="CARD_DATA_SIZE" value="4"/>
              <param name="GCLK_ID" value="45"/>
              <param name="GCLK_ID_SLOW" value="3"/>
              <param name="NB_OF_DEVICES" value="1"/>
              <param name="NB_REG_PVR" value="8"/>
              <param name="NB_REG_RR" value="4"/>
            </parameters>
          </instance>
          <instance name="SDHC1">
            <register-group name="SDHC1" name-in-module="SDHC" address-space="base" offset="0x46000000"/>
            <signals>
              <signal group="SDCD" function="I" pad="PB16"/>
              <signal group="SDCD" function="I" pad="PC20"/>
              <signal group="SDCK" function="I" pad="PA21"/>
              <signal group="SDCMD" function="I" pad="PA20"/>
              <signal group="SDDAT" index="0" function="I" pad="PB18"/>
              <signal group="SDDAT" index="1" function="I" pad="PB19"/>
              <signal group="SDDAT" index="2" function="I" pad="PB20"/>
              <signal group="SDDAT" index="3" function="I" pad="PB21"/>
              <signal group="SDWP" function="I" pad="PB17"/>
              <signal group="SDWP" function="I" pad="PC21"/>
            </signals>
            <parameters>
              <param name="CARD_DATA_SIZE" value="4"/>
              <param name="GCLK_ID" value="46"/>
              <param name="GCLK_ID_SLOW" value="3"/>
              <param name="NB_OF_DEVICES" value="1"/>
              <param name="NB_REG_PVR" value="8"/>
              <param name="NB_REG_RR" value="4"/>
            </parameters>
          </instance>
        </module>
        <module name="SERCOM" id="U2201" version="5.0.0">
          <instance name="SERCOM0">
            <register-group name="SERCOM0" name-in-module="SERCOM" address-space="base" offset="0x40003000"/>
            <signals>
              <signal group="PAD" index="0" function="D" pad="PA04"/>
              <signal group="PAD" index="0" function="D" pad="PC17"/>
              <signal group="PAD" index="0" function="C" pad="PA08"/>
              <signal group="PAD" index="0" function="C" pad="PB24"/>
              <signal group="PAD" index="1" function="D" pad="PA05"/>
              <signal group="PAD" index="1" function="D" pad="PC16"/>
              <signal group="PAD" index="1" function="C" pad="PA09"/>
              <signal group="PAD" index="1" function="C" pad="PB25"/>
              <signal group="PAD" index="2" function="D" pad="PA06"/>
              <signal group="PAD" index="2" function="D" pad="PC18"/>
              <signal group="PAD" index="2" function="C" pad="PA10"/>
              <signal group="PAD" index="2" function="C" pad="PC24"/>
              <signal group="PAD" index="3" function="D" pad="PA07"/>
              <signal group="PAD" index="3" function="D" pad="PC19"/>
              <signal group="PAD" index="3" function="C" pad="PA11"/>
              <signal group="PAD" index="3" function="C" pad="PC25"/>
            </signals>
            <parameters>
              <param name="CLK_REDUCTION" value="1"/>
              <param name="DLY_COMPENSATION" value="1"/>
              <param name="DMA" value="1"/>
              <param name="DMAC_ID_RX" value="4"/>
              <param name="DMAC_ID_TX" value="5"/>
              <param name="FIFO_DEPTH_POWER" value="1"/>
              <param name="GCLK_ID_CORE" value="7"/>
              <param name="GCLK_ID_SLOW" value="3"/>
              <param name="INT_MSB" value="6"/>
              <param name="PMSB" value="3"/>
              <param name="RETENTION_SUPPORT" value="0"/>
              <param name="SE_CNT" value="1"/>
              <param name="SPI" value="1"/>
              <param name="SPI_HW_SS_CTRL" value="1"/>
              <param name="SPI_ICSPACE_EXT" value="1"/>
              <param name="SPI_OZMO" value="0"/>
              <param name="SPI_WAKE_ON_SSL" value="1"/>
              <param name="TTBIT_EXTENSION" value="1"/>
              <param name="TWIM" value="1"/>
              <param name="TWIS" value="1"/>
              <param name="TWIS_AUTO_ACK" value="1"/>
              <param name="TWIS_GROUP_CMD" value="1"/>
              <param name="TWIS_SDASETUP_CNT_SIZE" value="8"/>
              <param name="TWIS_SDASETUP_SIZE" value="4"/>
              <param name="TWIS_SUDAT" value="1"/>
              <param name="TWI_FASTMP" value="1"/>
              <param name="TWI_HSMODE" value="1"/>
              <param name="TWI_SCLSM_MODE" value="1"/>
              <param name="TWI_SMB_TIMEOUTS" value="1"/>
              <param name="TWI_TENBIT_ADR" value="1"/>
              <param name="USART" value="1"/>
              <param name="USART_AUTOBAUD" value="1"/>
              <param name="USART_COLDET" value="1"/>
              <param name="USART_FLOW_CTRL" value="1"/>
              <param name="USART_FRAC_BAUD" value="1"/>
              <param name="USART_IRDA" value="1"/>
              <param name="USART_ISO7816" value="1"/>
              <param name="USART_LIN_MASTER" value="1"/>
              <param name="USART_RS485" value="1"/>
              <param name="USART_SAMPA_EXT" value="1"/>
              <param name="USART_SAMPR_EXT" value="1"/>
              <param name="INSTANCE_ID" value="12"/>
            </parameters>
          </instance>
          <instance name="SERCOM1">
            <register-group name="SERCOM1" name-in-module="SERCOM" address-space="base" offset="0x40003400"/>
            <signals>
              <signal group="PAD" index="0" function="D" pad="PA00"/>
              <signal group="PAD" index="0" function="C" pad="PA16"/>
              <signal group="PAD" index="0" function="C" pad="PC27"/>
              <signal group="PAD" index="1" function="D" pad="PA01"/>
              <signal group="PAD" index="1" function="C" pad="PA17"/>
              <signal group="PAD" index="1" function="C" pad="PC28"/>
              <signal group="PAD" index="2" function="D" pad="PA30"/>
              <signal group="PAD" index="2" function="C" pad="PA18"/>
              <signal group="PAD" index="2" function="C" pad="PB22"/>
              <signal group="PAD" index="3" function="D" pad="PA31"/>
              <signal group="PAD" index="3" function="C" pad="PA19"/>
              <signal group="PAD" index="3" function="C" pad="PB23"/>
            </signals>
            <parameters>
              <param name="CLK_REDUCTION" value="1"/>
              <param name="DLY_COMPENSATION" value="1"/>
              <param name="DMA" value="1"/>
              <param name="DMAC_ID_RX" value="6"/>
              <param name="DMAC_ID_TX" value="7"/>
              <param name="FIFO_DEPTH_POWER" value="1"/>
              <param name="GCLK_ID_CORE" value="8"/>
              <param name="GCLK_ID_SLOW" value="3"/>
              <param name="INT_MSB" value="6"/>
              <param name="PMSB" value="3"/>
              <param name="RETENTION_SUPPORT" value="0"/>
              <param name="SE_CNT" value="1"/>
              <param name="SPI" value="1"/>
              <param name="SPI_HW_SS_CTRL" value="1"/>
              <param name="SPI_ICSPACE_EXT" value="1"/>
              <param name="SPI_OZMO" value="0"/>
              <param name="SPI_WAKE_ON_SSL" value="1"/>
              <param name="TTBIT_EXTENSION" value="1"/>
              <param name="TWIM" value="1"/>
              <param name="TWIS" value="1"/>
              <param name="TWIS_AUTO_ACK" value="1"/>
              <param name="TWIS_GROUP_CMD" value="1"/>
              <param name="TWIS_SDASETUP_CNT_SIZE" value="8"/>
              <param name="TWIS_SDASETUP_SIZE" value="4"/>
              <param name="TWIS_SUDAT" value="1"/>
              <param name="TWI_FASTMP" value="1"/>
              <param name="TWI_HSMODE" value="1"/>
              <param name="TWI_SCLSM_MODE" value="1"/>
              <param name="TWI_SMB_TIMEOUTS" value="1"/>
              <param name="TWI_TENBIT_ADR" value="1"/>
              <param name="USART" value="1"/>
              <param name="USART_AUTOBAUD" value="1"/>
              <param name="USART_COLDET" value="1"/>
              <param name="USART_FLOW_CTRL" value="1"/>
              <param name="USART_FRAC_BAUD" value="1"/>
              <param name="USART_IRDA" value="1"/>
              <param name="USART_ISO7816" value="1"/>
              <param name="USART_LIN_MASTER" value="1"/>
              <param name="USART_RS485" value="1"/>
              <param name="USART_SAMPA_EXT" value="1"/>
              <param name="USART_SAMPR_EXT" value="1"/>
              <param name="INSTANCE_ID" value="13"/>
            </parameters>
          </instance>
