Duet3D/Duet3Expansion/src/atmel/SAME53_DFP/1.0.57/atdf/ATSAME53N20A.atdf
        <register name="IHCE" offset="0x1A8" rw="R" size="4" access-size="4" initval="0x00000000" caption="IP Header Checksum Errors Register">
          <bitfield name="HCKER" caption="IP Header Checksum Errors" mask="0xFF"/>
        </register>
        <register name="TCE" offset="0x1AC" rw="R" size="4" access-size="4" initval="0x00000000" caption="TCP Checksum Errors Register">
          <bitfield name="TCKER" caption="TCP Checksum Errors" mask="0xFF"/>
        </register>
        <register name="UCE" offset="0x1B0" rw="R" size="4" access-size="4" initval="0x00000000" caption="UDP Checksum Errors Register">
          <bitfield name="UCKER" caption="UDP Checksum Errors" mask="0xFF"/>
        </register>
        <register name="TISUBN" offset="0x1BC" rw="RW" size="4" access-size="4" initval="0x00000000" caption="1588 Timer Increment [15:0] Sub-Nanoseconds Register">
          <bitfield name="LSBTIR" caption="Lower Significant Bits of Timer Increment" mask="0xFFFF"/>
        </register>
        <register name="TSH" offset="0x1C0" rw="RW" size="4" access-size="4" initval="0x00000000" caption="1588 Timer Seconds High [15:0] Register">
          <bitfield name="TCS" caption="Timer Count in Seconds" mask="0xFFFF"/>
        </register>
        <register name="TSSSL" offset="0x1C8" rw="RW" size="4" access-size="4" initval="0x00000000" caption="1588 Timer Sync Strobe Seconds [31:0] Register">
          <bitfield name="VTS" caption="Value of Timer Seconds Register Capture" mask="0xFFFFFFFF"/>
        </register>
        <register name="TSSN" offset="0x1CC" rw="RW" size="4" access-size="4" initval="0x00000000" caption="1588 Timer Sync Strobe Nanoseconds Register">
          <bitfield name="VTN" caption="Value Timer Nanoseconds Register Capture" mask="0x3FFFFFFF"/>
        </register>
        <register name="TSL" offset="0x1D0" rw="RW" size="4" access-size="4" initval="0x00000000" caption="1588 Timer Seconds [31:0] Register">
          <bitfield name="TCS" caption="Timer Count in Seconds" mask="0xFFFFFFFF"/>
        </register>
        <register name="TN" offset="0x1D4" rw="RW" size="4" access-size="4" initval="0x00000000" caption="1588 Timer Nanoseconds Register">
          <bitfield name="TNS" caption="Timer Count in Nanoseconds" mask="0x3FFFFFFF"/>
        </register>
        <register name="TA" offset="0x1D8" rw="W" size="4" access-size="4" initval="0x00000000" caption="1588 Timer Adjust Register">
          <bitfield name="ITDT" caption="Increment/Decrement" mask="0x3FFFFFFF"/>
          <bitfield name="ADJ" caption="Adjust 1588 Timer" mask="0x80000000"/>
        </register>
        <register name="TI" offset="0x1DC" rw="RW" size="4" access-size="4" initval="0x00000000" caption="1588 Timer Increment Register">
          <bitfield name="CNS" caption="Count Nanoseconds" mask="0xFF"/>
          <bitfield name="ACNS" caption="Alternative Count Nanoseconds" mask="0xFF00"/>
          <bitfield name="NIT" caption="Number of Increments" mask="0xFF0000"/>
        </register>
        <register name="EFTSL" offset="0x1E0" rw="R" size="4" access-size="4" initval="0x00000000" caption="PTP Event Frame Transmitted Seconds Low Register">
          <bitfield name="RUD" caption="Register Update" mask="0xFFFFFFFF"/>
        </register>
        <register name="EFTN" offset="0x1E4" rw="R" size="4" access-size="4" initval="0x00000000" caption="PTP Event Frame Transmitted Nanoseconds">
          <bitfield name="RUD" caption="Register Update" mask="0x3FFFFFFF"/>
        </register>
        <register name="EFRSL" offset="0x1E8" rw="R" size="4" access-size="4" initval="0x00000000" caption="PTP Event Frame Received Seconds Low Register">
          <bitfield name="RUD" caption="Register Update" mask="0xFFFFFFFF"/>
        </register>
        <register name="EFRN" offset="0x1EC" rw="R" size="4" access-size="4" initval="0x00000000" caption="PTP Event Frame Received Nanoseconds">
          <bitfield name="RUD" caption="Register Update" mask="0x3FFFFFFF"/>
        </register>
        <register name="PEFTSL" offset="0x1F0" rw="R" size="4" access-size="4" initval="0x00000000" caption="PTP Peer Event Frame Transmitted Seconds Low Register">
          <bitfield name="RUD" caption="Register Update" mask="0xFFFFFFFF"/>
        </register>
        <register name="PEFTN" offset="0x1F4" rw="R" size="4" access-size="4" initval="0x00000000" caption="PTP Peer Event Frame Transmitted Nanoseconds">
          <bitfield name="RUD" caption="Register Update" mask="0x3FFFFFFF"/>
        </register>
        <register name="PEFRSL" offset="0x1F8" rw="R" size="4" access-size="4" initval="0x00000000" caption="PTP Peer Event Frame Received Seconds Low Register">
          <bitfield name="RUD" caption="Register Update" mask="0xFFFFFFFF"/>
        </register>
        <register name="PEFRN" offset="0x1FC" rw="R" size="4" access-size="4" initval="0x00000000" caption="PTP Peer Event Frame Received Nanoseconds">
          <bitfield name="RUD" caption="Register Update" mask="0x3FFFFFFF"/>
        </register>
        <register name="RLPITR" offset="0x270" rw="R" size="4" access-size="4" initval="0x00000000" caption="Receive LPI transition Register">
          <bitfield name="RLPITR" caption="Count number of times transition from rx normal idle to low power idle" mask="0xFFFF"/>
        </register>
        <register name="RLPITI" offset="0x274" rw="R" size="4" access-size="4" initval="0x00000000" caption="Receive LPI Time Register">
          <bitfield name="RLPITI" caption="Increment once over 16 ahb clock when LPI indication bit 20 is set in rx mode" mask="0xFFFFFF"/>
        </register>
        <register name="TLPITR" offset="0x278" rw="R" size="4" access-size="4" initval="0x00000000" caption="Receive LPI transition Register">
          <bitfield name="TLPITR" caption="Count number of times enable LPI tx bit 20 goes from low to high" mask="0xFFFF"/>
        </register>
        <register name="TLPITI" offset="0x27C" rw="R" size="4" access-size="4" initval="0x00000000" caption="Receive LPI Time Register">
          <bitfield name="TLPITI" caption="Increment once over 16 ahb clock when LPI indication bit 20 is set in tx mode" mask="0xFFFFFF"/>
        </register>
      </register-group>
    </module>
