Duet3D/Duet3Expansion/src/atmel/SAME53_DFP/1.0.57/atdf/ATSAME53N20A.atdf
      <value-group name="SDHC_NISTR__DMAINT">
        <value name="NO" caption="No DMA Interrupt" value="0"/>
        <value name="YES" caption="DMA Interrupt is generated" value="1"/>
      </value-group>
      <value-group name="SDHC_NISTR__ERRINT">
        <value name="NO" caption="No Error" value="0"/>
        <value name="YES" caption="Error" value="1"/>
      </value-group>
      <value-group name="SDHC_NISTR__INTA">
        <value name="NO" caption="No interrupt is detected" value="0"/>
        <value name="YES" caption="INT_A is detected" value="1"/>
      </value-group>
      <value-group name="SDHC_NISTR__INTB">
        <value name="NO" caption="No interrupt is detected" value="0"/>
        <value name="YES" caption="INT_B is detected" value="1"/>
      </value-group>
      <value-group name="SDHC_NISTR__INTC">
        <value name="NO" caption="No interrupt is detected" value="0"/>
        <value name="YES" caption="INT_C is detected" value="1"/>
      </value-group>
      <value-group name="SDHC_NISTR__RTEVT">
        <value name="OK" caption="Re-Tuning is not required" value="0"/>
        <value name="REQUIRED" caption="Re-Tuning should be performed" value="1"/>
      </value-group>
      <value-group name="SDHC_NISTR__TRFC">
        <value name="NO" caption="Not complete" value="0"/>
        <value name="YES" caption="Command execution is completed" value="1"/>
      </value-group>
      <value-group name="SDHC_EISTR__ACMD">
        <value name="NO" caption="No Error" value="0"/>
        <value name="YES" caption="Error" value="1"/>
      </value-group>
      <value-group name="SDHC_EISTR__ADMA">
        <value name="NO" caption="No Error" value="0"/>
        <value name="YES" caption="Error" value="1"/>
      </value-group>
      <value-group name="SDHC_EISTR__CMDCRC">
        <value name="NO" caption="No Error" value="0"/>
        <value name="YES" caption="CRC Error Generated" value="1"/>
      </value-group>
      <value-group name="SDHC_EISTR__CMDEND">
        <value name="NO" caption="No error" value="0"/>
        <value name="YES" caption="End Bit Error Generated" value="1"/>
      </value-group>
      <value-group name="SDHC_EISTR__CMDIDX">
        <value name="NO" caption="No Error" value="0"/>
        <value name="YES" caption="Error" value="1"/>
      </value-group>
      <value-group name="SDHC_EISTR__CMDTEO">
        <value name="NO" caption="No Error" value="0"/>
        <value name="YES" caption="Timeout" value="1"/>
      </value-group>
      <value-group name="SDHC_EISTR__CURLIM">
        <value name="NO" caption="No Error" value="0"/>
        <value name="YES" caption="Power Fail" value="1"/>
      </value-group>
      <value-group name="SDHC_EISTR__DATCRC">
        <value name="NO" caption="No Error" value="0"/>
        <value name="YES" caption="Error" value="1"/>
      </value-group>
      <value-group name="SDHC_EISTR__DATEND">
        <value name="NO" caption="No Error" value="0"/>
        <value name="YES" caption="Error" value="1"/>
      </value-group>
      <value-group name="SDHC_EISTR__DATTEO">
        <value name="NO" caption="No Error" value="0"/>
        <value name="YES" caption="Timeout" value="1"/>
      </value-group>
      <value-group name="SDHC_EISTR__TUNING">
        <value name="NO" caption="No Error" value="0"/>
        <value name="YES" caption="Error" value="1"/>
      </value-group>
      <value-group name="SDHC_EISTR__BOOTAE">
        <value name="0" caption="FIFO contains at least one byte" value="0"/>
        <value name="1" caption="FIFO is empty" value="1"/>
      </value-group>
      <value-group name="SDHC_NISTER__BLKGE">
        <value name="MASKED" caption="Masked" value="0"/>
        <value name="ENABLED" caption="Enabled" value="1"/>
      </value-group>
      <value-group name="SDHC_NISTER__BRDRDY">
        <value name="MASKED" caption="Masked" value="0"/>
        <value name="ENABLED" caption="Enabled" value="1"/>
      </value-group>
      <value-group name="SDHC_NISTER__BWRRDY">
        <value name="MASKED" caption="Masked" value="0"/>
        <value name="ENABLED" caption="Enabled" value="1"/>
      </value-group>
      <value-group name="SDHC_NISTER__CINS">
        <value name="MASKED" caption="Masked" value="0"/>
        <value name="ENABLED" caption="Enabled" value="1"/>
      </value-group>
      <value-group name="SDHC_NISTER__CINT">
        <value name="MASKED" caption="Masked" value="0"/>
        <value name="ENABLED" caption="Enabled" value="1"/>
      </value-group>
      <value-group name="SDHC_NISTER__CMDC">
        <value name="MASKED" caption="Masked" value="0"/>
        <value name="ENABLED" caption="Enabled" value="1"/>
      </value-group>
      <value-group name="SDHC_NISTER__CREM">
        <value name="MASKED" caption="Masked" value="0"/>
        <value name="ENABLED" caption="Enabled" value="1"/>
      </value-group>
      <value-group name="SDHC_NISTER__DMAINT">
        <value name="MASKED" caption="Masked" value="0"/>
        <value name="ENABLED" caption="Enabled" value="1"/>
      </value-group>
      <value-group name="SDHC_NISTER__INTA">
        <value name="MASKED" caption="Masked" value="0"/>
        <value name="ENABLED" caption="Enabled" value="1"/>
      </value-group>
      <value-group name="SDHC_NISTER__INTB">
        <value name="MASKED" caption="Masked" value="0"/>
        <value name="ENABLED" caption="Enabled" value="1"/>
      </value-group>
      <value-group name="SDHC_NISTER__INTC">
        <value name="MASKED" caption="Masked" value="0"/>
        <value name="ENABLED" caption="Enabled" value="1"/>
      </value-group>
      <value-group name="SDHC_NISTER__RTEVT">
        <value name="MASKED" caption="Masked" value="0"/>
        <value name="ENABLED" caption="Enabled" value="1"/>
      </value-group>
      <value-group name="SDHC_NISTER__TRFC">
        <value name="MASKED" caption="Masked" value="0"/>
        <value name="ENABLED" caption="Enabled" value="1"/>
      </value-group>
